# 1) Репозиторий - хранилище проекта, код, документация и тд.
# 2) Ветка - независимая линия разработки, полезная вещь
# 3) Коммит - сохранение, чекпоинт в программе
# 4) Пуш - отправка локальных изменений в удаленный репозиторий, то бишь на гит хаб

# Команды

# git hub - инициализирует новый репозиторий 
# git clone <ссылка> - кланирует удаленный репозиторий 
# git status - показывавет состояние каждого файла в рабочей папке
# git add <файл> ИЛИ git add . - добавляет файлы в учет для следующего коммита 
# commit -m 'сообщение / описание' - фокусирует изменения в репозиторий
# git push - отправляет изменения в удаленный репозиторий 
# git checkout <имя ветки> - переключается на указанную ветку
